subroutine lonlat2xy(lon, lat, lon0, lat0, x, y)
  use constants, only : pi, r1, r2, ec
  implicit none
  !!åoìxÅEà‹ìxÇó^Ç¶ÇƒïΩñ íºäpç¿ïWånÇ≈x(ìå+), y(ñk+)Çï‘Ç∑
  real*8, intent(in) :: lon, lat
  real*8, intent(in) :: lon0, lat0
  real*8, intent(out) :: x, y

  real*8, parameter :: e = sqrt(2.0d0 * ec - ec ** 2)            !!ëÊàÍó£êSó¶
  real*8, parameter :: et = sqrt(e ** 2 / (1.0d0 - e ** 2))    !!ëÊìÒó£êSó¶
  real*8, parameter :: c = r1 ** 2 / r2                         !!ã…Ç≈ÇÃã»ó¶îºåa
  real*8, parameter :: m0 = 0.9999d0                       !!å¥ì_Ç≈ÇÃèké⁄åWêî
  real*8 :: m, n, r, w, v

  !!ê‘ìπÇ©ÇÁÇÃéqåﬂê¸å í∑ÇãÅÇﬂÇÈÇΩÇﬂÇÃïœêî
  real*8 :: b1, b2, b3, b4, b5, b6, b7, b8, b9
  real*8 :: aa, bb, cc, dd, ee, ff, gg, hh, ii
  real*8 :: sdist, s0dist, dlambda, eta, t

  v = sqrt(1.0d0 + (et * cos(lat * pi / 180.0d0)) ** 2)
  w = sqrt(1.0d0 - (e * sin(lat * pi / 180.0d0)) ** 2)
  m = c / (v ** 3)                       !!éqåﬂê¸ã»ó¶îºåa
  n = c / v                              !!âKì—ê¸ã»ó¶îºåa
  r = c / (v ** 2)                       !!ïΩãœã»ó¶îºåa

  aa = &
  &  4927697775.0d0 / 7516192768.0d0 * e ** 16 &
  &  + 19324305.0d0 / 29360128.0d0 * e ** 14 &
  &  + 693693.0d0 / 1048576.0d0 * e ** 12 &
  &  + 43659.0d0 / 65536.0d0 * e ** 10 &
  &  + 11025.0d0 / 16384.0d0 * e ** 8 &
  &  + 175.0d0 / 256.0d0 * e ** 6 &
  &  + 45.0d0 / 64.0d0 * e ** 4 &
  &  + 3.0d0 / 4.0d0 * e ** 2 &
  &  + 1.0d0

  bb = &
  &  547521975.0d0 / 469762048.0d0 * e ** 16 &
  &  + 135270135.0d0 / 117440512.0d0 * e ** 14 &
  &  + 297297.0d0 / 262144.0d0 * e ** 12 &
  &  + 72765.0d0 / 65536.0d0 * e ** 10 &
  &  + 2205.0d0 / 2048.0d0 * e ** 8 &
  &  + 525.0d0 / 512.0d0 * e ** 6 &
  &  + 15.0d0 / 16.0d0 * e ** 4 &
  &  + 3.0d0 / 4.0d0 * e ** 2

  cc = &
  &  766530765.0d0 / 939524096.0d0 * e ** 16 &
  &  + 45090045.0d0 / 58720256.0d0 * e ** 14 &
  &  + 1486485.0d0 / 2097152.0d0 * e ** 12 &
  &  + 10395.0d0 / 16384.0d0 * e ** 10 & 
  &  + 2205.0d0 / 4096.0d0 * e ** 8 &
  &  + 105.0d0 / 256.0d0 * e ** 6 &
  &  + 15.0d0 / 64.0d0 * e ** 4


  dd = &
  &  209053845.0d0 / 469762048.0d0 * e ** 16 &
  &  + 45090045.0d0 / 117440512.0d0 * e ** 14 &
  &  + 165165.0d0 / 524288.0d0 * e ** 12 &
  &  + 31185.0d0 / 131072.0d0 * e ** 10 &
  &  + 315.0d0 / 2048.0d0 * e ** 8 &
  &  + 35.0d0 / 512.0d0 * e ** 6


  ee = &
  &  348423075.0d0 / 1879048192.0d0 * e ** 16 &
  &  + 4099095.0d0 / 29360128.0d0 * e ** 14 &
  &  + 99099.0d0 / 1048576.0d0 * e ** 12 &
  &  + 3465.0d0 / 65536.0d0 * e ** 10 &
  &  + 315.0d0 / 16384.0d0 * e ** 8

  ff = &
  &  26801775.0d0 / 469762048.0d0 * e ** 16 &
  &  + 4099095.0d0 / 117440512.0d0 * e ** 14 &
  &  + 9009.0d0 / 524288.0d0 * e ** 12 &
  &  + 693.0d0 / 131072.0d0 * e ** 10 

  gg = &
  &  11486475.0d0 / 939524096.0d0 * e ** 16 &
  &  + 315315.0d0 / 58720256.0d0 * e ** 14 &
  &  + 3003.0d0 / 2097152.0d0 * e ** 12

  hh = &
  &  + 765765.0d0 / 469762048.0d0 * e ** 16 &
  &  + 45045.0d0 / 117440512.0d0 * e ** 14

  ii = 765765.0d0 / 7516192768.0d0 * e ** 16
  
  b1 = r1 * (1.0d0 - e ** 2) * aa
  b2 = r1 * (1.0d0 - e ** 2) * (-bb / 2.0d0)
  b3 = r1 * (1.0d0 - e ** 2) * (cc / 4.0d0)
  b4 = r1 * (1.0d0 - e ** 2) * (-dd / 6.0d0)
  b5 = r1 * (1.0d0 - e ** 2) * (ee / 8.0d0)
  b6 = r1 * (1.0d0 - e ** 2) * (-ff / 10.0d0)
  b7 = r1 * (1.0d0 - e ** 2) * (gg / 12.0d0)
  b8 = r1 * (1.0d0 - e ** 2) * (-hh / 14.0d0)
  b9 = r1 * (1.0d0 - e ** 2) * (ii / 16.0d0)

  sdist = b1 * lat * pi / 180.0d0 + b2 * sin(2.0d0 * lat * pi / 180.0d0) &
  &  + b3 * sin(4.0d0 * lat * pi / 180.0d0) + b4 * sin(6.0d0 * lat * pi / 180.0d0) &
  &  + b5 * sin(8.0d0 * lat * pi / 180.0d0) + b6 * sin(10.0d0 * lat * pi / 180.0d0) &
  &  + b7 * sin(12.0d0 * lat * pi / 180.0d0) + b8 * sin(14.0d0 * lat * pi / 180.0d0) &
  &  + b9 * sin(16.0d0 * lat * pi / 180.0d0)

  s0dist = b1 * lat0 * pi / 180.0d0 + b2 * sin(2.0d0 * lat0 * pi / 180.0d0) &
  &  + b3 * sin(4.0d0 * lat0 * pi / 180.0d0) + b4 * sin(6.0d0 * lat0 * pi / 180.0d0) &
  &  + b5 * sin(8.0d0 * lat0 * pi / 180.0d0) + b6 * sin(10.0d0 * lat0 * pi / 180.0d0) &
  &  + b7 * sin(12.0d0 * lat0 * pi / 180.0d0) + b8 * sin(14.0d0 * lat0 * pi / 180.0d0) &
  &  + b9 * sin(16.0d0 * lat0 * pi / 180.0d0)

  dlambda = pi / 180.0d0 * (lon - lon0)
  eta = et * cos(lat * pi / 180.0d0)
  t = tan(lat * pi / 180.0d0)

  x = (n * cos(lat * pi / 180.0d0) * dlambda &
  &  - 1.0d0 / 6.0d0 * n * cos(lat * pi / 180.0d0) ** 3 &
  &  * (-1.0d0 + t ** 2 - eta ** 2) * dlambda ** 3 &
  &  - 1.0d0 / 120.0d0 * n * cos(lat * pi / 180.0d0) ** 5 &
  &  * (-5.0d0 + 18.0d0 * t ** 2 - t ** 4 - 14.0d0 * eta ** 2 + 58.0d0 * t ** 2 * eta ** 2) &
  &  * dlambda ** 5 &
  &  - 1.0d0 / 5040.0d0 * n * cos(lat * pi / 180.0d0) ** 7 &
  &  * (-61.0d0 + 479.0d0 * t ** 2 - 179.0d0 * t ** 4 + t ** 6) * dlambda ** 7) * m0

  y = ((sdist - s0dist) + 1.0d0 / 2.0d0 * n * cos(lat * pi / 180.0d0) ** 2 * t * dlambda ** 2 &
  &  + 1.0d0 / 24.0d0 * n * cos(lat * pi / 180.0d0) ** 4 * t &
  &  * (5.0d0 - t ** 2 + 9.0d0 * eta ** 2 + 4.0d0 * eta ** 4) * dlambda ** 4 &
  &  - 1.0d0 / 720.0d0 * n * cos(lat * pi / 180.0d0) ** 6 * t &
  &  * (-61.0d0 + 58.0d0 * t ** 2 - t ** 4 - 270.0d0 * eta ** 2 + 330.0d0 * t ** 2 * eta ** 2) &
  &  * dlambda ** 6 &
  &  - 1.0d0 / 40320.0d0 * n * cos(lat * pi / 180.0d0) ** 8 * t &
  &  * (-1385.0d0 + 3111.0d0 * t ** 2 - 543.0d0 * t ** 4 + t ** 6) * dlambda ** 8) * m0

  x = x / 1000.0d0
  y = y / 1000.0d0
  
  return
end subroutine lonlat2xy
